SpenceKonde/DxCore/megaavr/boards.txt
#----------------------------------------#
# BrownOut detection (BOD) options       #
#________________________________________#
avrdbopti.menu.bodvoltage.1v9=1.9V
avrdbopti.menu.bodvoltage.1v9.bootloader.bodlevbits=000
avrdbopti.menu.bodvoltage.2v45=2.45V
avrdbopti.menu.bodvoltage.2v45.bootloader.bodlevbits=001
avrdbopti.menu.bodvoltage.2v70=2.70V
avrdbopti.menu.bodvoltage.2v70.bootloader.bodlevbits=010
avrdbopti.menu.bodvoltage.2v85=2.85V
avrdbopti.menu.bodvoltage.2v85.bootloader.bodlevbits=011
avrdbopti.menu.bodmode.disabled=Disabled/Disabled
avrdbopti.menu.bodmode.enabled=Enabled/Enabled
avrdbopti.menu.bodmode.ensampfast=Enabled/Sampled (128 Hz)
avrdbopti.menu.bodmode.ensampslow=Enabled/Sampled (32 Hz)
avrdbopti.menu.bodmode.sampledfast=Sampled/Sampled (128 Hz)
avrdbopti.menu.bodmode.sampledslow=Sampled/Sampled (32 Hz)
avrdbopti.menu.bodmode.sampdisfast=Sampled/Disabled (128 Hz)
avrdbopti.menu.bodmode.sampdisslow=Sampled/Disabled (32 Hz)
avrdbopti.menu.bodmode.endisholdwake=Enabled hold wakeup/Disabled
avrdbopti.menu.bodmode.disabled.bootloader.BODCFG=0x00
avrdbopti.menu.bodmode.enabled.bootloader.bodmodebits=00101
avrdbopti.menu.bodmode.ensampfast.bootloader.bodmodebits=00110
avrdbopti.menu.bodmode.ensampslow.bootloader.bodmodebits=10110
avrdbopti.menu.bodmode.samplefast.bootloader.bodmodebits=01010
avrdbopti.menu.bodmode.sampleslow.bootloader.bodmodebits=11010
avrdbopti.menu.bodmode.sampdisfast.bootloader.bodmodebits=01000
avrdbopti.menu.bodmode.sampdisslow.bootloader.bodmodebits=11000
avrdbopti.menu.bodmode.endisholdwake.bootloader.bodmodebits=01100

#----------------------------------------#
# Reset pin as input option              #
#________________________________________#
avrdbopti.menu.resetpin.reset=Hardware Reset (recommended)
avrdbopti.menu.resetpin.reset.bootloader.resetpinbits=10
avrdbopti.menu.resetpin.input=Input (no output, ever)
avrdbopti.menu.resetpin.input.bootloader.resetpinbits=00

#----------------------------------------#
# millis/micros timing source            #
#________________________________________#
avrdbopti.menu.millis.tcb2=TCB2 (recommended)
avrdbopti.menu.millis.disabled=Disabled (delay() only)
avrdbopti.menu.millis.tcb0=TCB0
avrdbopti.menu.millis.tcb1=TCB1
avrdbopti.menu.millis.tcb3=TCB3 (48/64-pin parts only)
avrdbopti.menu.millis.tcb4=TCB4 (64-pin parts only)
avrdbopti.menu.millis.tca0=TCA0
avrdbopti.menu.millis.tca1=TCA1 (48/64-pin parts only)
#avrdbopti.menu.millis.tcd0=TCD0
avrdbopti.menu.millis.tcb0.build.millistimer=B0
avrdbopti.menu.millis.tcb1.build.millistimer=B1
avrdbopti.menu.millis.tcb2.build.millistimer=B2
avrdbopti.menu.millis.tcb3.build.millistimer=B3
avrdbopti.menu.millis.tcb4.build.millistimer=B4
avrdbopti.menu.millis.tca0.build.millistimer=A0
avrdbopti.menu.millis.tca1.build.millistimer=A1
#avrdbopti.menu.millis.tcd0.build.millistimer=D0
avrdbopti.menu.millis.disabled.build.millistimer=NONE

#----------------------------------------#
# printf() version options               #
#________________________________________#
avrdbopti.menu.printf.default=Default (doesn't print floats, 1.4k flash use)
avrdbopti.menu.printf.full=Full, 2.6k, prints floats
avrdbopti.menu.printf.full.build.printf=-Wl,-u,vfprintf -lprintf_flt
avrdbopti.menu.printf.full.build.printfabr=.pfF
avrdbopti.menu.printf.minimal=Minimal, 1.1k flash used
avrdbopti.menu.printf.minimal.build.printf=-Wl,-u,vfprintf -lprintf_min
avrdbopti.menu.printf.minimal.build.printfabr=.pfM

#----------------------------------------#
# attachInterrupt Mode                   #
#________________________________________#
avrdbopti.menu.attach.allenabled=On all pins, like usual
avrdbopti.menu.attach.allenabled.build.attachmode=-DCORE_ATTACH_ALL
avrdbopti.menu.attach.manual=Only enabled ports. Please see documentation.
avrdbopti.menu.attach.manual.build.attachmode=-DCORE_ATTACH_NONE
avrdbopti.menu.attach.oldversion=Old version, (may fix bugs)
avrdbopti.menu.attach.oldversion.build.attachmode=-DCORE_ATTACH_OLD

#----------------------------------------#
# MVIO menu                              #
#________________________________________#
avrdbopti.menu.mvio.enabled=Enabled
avrdbopti.menu.mvio.enabled.bootloader.mviobits=01
avrdbopti.menu.mvio.disabled=Disabled
avrdbopti.menu.mvio.disabled.bootloader.mviobits=10

#----------------------------------------#
# Startup time options                   #
#________________________________________#
avrdbopti.menu.startuptime.8=8ms
avrdbopti.menu.startuptime.0=0ms
avrdbopti.menu.startuptime.1=1ms
avrdbopti.menu.startuptime.2=2ms
avrdbopti.menu.startuptime.4=4ms
avrdbopti.menu.startuptime.16=16ms
avrdbopti.menu.startuptime.32=32ms
avrdbopti.menu.startuptime.64=64ms
avrdbopti.menu.startuptime.0.bootloader.sutbits=000
avrdbopti.menu.startuptime.1.bootloader.sutbits=001
avrdbopti.menu.startuptime.2.bootloader.sutbits=010
avrdbopti.menu.startuptime.4.bootloader.sutbits=011
avrdbopti.menu.startuptime.8.bootloader.sutbits=100
avrdbopti.menu.startuptime.16.bootloader.sutbits=101
avrdbopti.menu.startuptime.32.bootloader.sutbits=110
avrdbopti.menu.startuptime.64.bootloader.sutbits=111

#-------------------------------------#
#         Wire Mode Selection         #
# To enable TWI1 or master+slave mode #
#_____________________________________#
avrdbopti.menu.wiremode.mors1=1x Wire, Master or Slave (least Flash & RAM)
avrdbopti.menu.wiremode.mors1.build.wire.mode=MORS_SINGLE
avrdbopti.menu.wiremode.mors1.build.wireabr=.wO
avrdbopti.menu.wiremode.mands1=1x Wire, Master and Slave
avrdbopti.menu.wiremode.mands1.build.wire.mode=MANDS_SINGLE
avrdbopti.menu.wiremode.mands1.build.wireabr=.wA
avrdbopti.menu.wiremode.mors2=2x Wire, Master or Slave (not available on 28-pin devices)
avrdbopti.menu.wiremode.mors2.build.wire.mode=MORS_BOTH
avrdbopti.menu.wiremode.mors2.build.wireabr=.wO2
avrdbopti.menu.wiremode.mands2=2x Wire, Master and Slave (not available on 28-pin devices)
avrdbopti.menu.wiremode.mands2.build.wire.mode=MANDS_BOTH
avrdbopti.menu.wiremode.mands2.build.wireabr=.wA2


