SpenceKonde/DxCore/megaavr/boards.txt
#----------------------------------------#
# Clock speed and source options         #
#________________________________________#
#avrddopti.menu.clock.24internal=24 MHz internal
#avrddopti.menu.clock.24internal.build.f_cpu=24000000L
#avrddopti.menu.clock.24internal.build.speed=24
#avrddopti.menu.clock.24internal.build.clocksource=0
#avrddopti.menu.clock.20internal=20 MHz internal
#avrddopti.menu.clock.20internal.build.f_cpu=20000000L
#avrddopti.menu.clock.20internal.build.speed=20
#avrddopti.menu.clock.20internal.build.clocksource=0
#avrddopti.menu.clock.16internal=16 MHz internal
#avrddopti.menu.clock.16internal.build.f_cpu=16000000L
#avrddopti.menu.clock.16internal.build.speed=16
#avrddopti.menu.clock.16internal.build.clocksource=0
#avrddopti.menu.clock.12internal=12 MHz internal
#avrddopti.menu.clock.12internal.build.f_cpu=12000000L
#avrddopti.menu.clock.12internal.build.speed=12
#avrddopti.menu.clock.12internal.build.clocksource=0
#avrddopti.menu.clock.10internal=10 MHz internal
#avrddopti.menu.clock.10internal.build.f_cpu=10000000L
#avrddopti.menu.clock.10internal.build.speed=10
#avrddopti.menu.clock.10internal.build.clocksource=0
#avrddopti.menu.clock.8internal=8 MHz internal
#avrddopti.menu.clock.8internal.build.f_cpu=8000000L
#avrddopti.menu.clock.8internal.build.speed=8
#avrddopti.menu.clock.8internal.build.clocksource=0
#avrddopti.menu.clock.4internal=4 MHz internal
#avrddopti.menu.clock.4internal.build.f_cpu=4000000L
#avrddopti.menu.clock.4internal.build.speed=4
#avrddopti.menu.clock.4internal.build.clocksource=0
#avrddopti.menu.clock.1internal=1 MHz internal
#avrddopti.menu.clock.1internal.build.f_cpu=1000000L
#avrddopti.menu.clock.1internal.build.speed=1
#avrddopti.menu.clock.1internal.build.clocksource=0
#avrddopti.menu.clock.24crystal=24 MHz crystal
#avrddopti.menu.clock.24crystal.build.f_cpu=24000000L
#avrddopti.menu.clock.24crystal.build.speed=24
#avrddopti.menu.clock.24crystal.build.clocksource=1
#avrddopti.menu.clock.20crystal=20 MHz crystal
#avrddopti.menu.clock.20crystal.build.f_cpu=20000000L
#avrddopti.menu.clock.20crystal.build.speed=20
#avrddopti.menu.clock.20crystal.build.clocksource=1
#avrddopti.menu.clock.16crystal=16 MHz crystal
#avrddopti.menu.clock.16crystal.build.f_cpu=16000000L
#avrddopti.menu.clock.16crystal.build.speed=16
#avrddopti.menu.clock.16crystal.build.clocksource=1
#avrddopti.menu.clock.12crystal=12 MHz crystal
#avrddopti.menu.clock.12crystal.build.f_cpu=12000000L
#avrddopti.menu.clock.12crystal.build.speed=12
#avrddopti.menu.clock.12crystal.build.clocksource=1
#avrddopti.menu.clock.8crystal=8 MHz crystal
#avrddopti.menu.clock.8crystal.build.f_cpu=8000000L
#avrddopti.menu.clock.8crystal.build.speed=8
#avrddopti.menu.clock.8crystal.build.clocksource=1
#avrddopti.menu.clock.24extclock=24 MHz ext. clock
#avrddopti.menu.clock.24extclock.build.f_cpu=24000000L
#avrddopti.menu.clock.24extclock.build.speed=24
#avrddopti.menu.clock.24extclock.build.clocksource=2
#avrddopti.menu.clock.20extclock=20 MHz ext. clock
#avrddopti.menu.clock.20extclock.build.f_cpu=20000000L
#avrddopti.menu.clock.20extclock.build.speed=20
#avrddopti.menu.clock.20extclock.build.clocksource=2
#avrddopti.menu.clock.16extclock=16 MHz ext. clock
#avrddopti.menu.clock.16extclock.build.f_cpu=16000000L
#avrddopti.menu.clock.16extclock.build.speed=16
#avrddopti.menu.clock.16extclock.build.clocksource=2
#avrddopti.menu.clock.12extclock=12 MHz ext. clock
#avrddopti.menu.clock.12extclock.build.f_cpu=12000000L
#avrddopti.menu.clock.12extclock.build.speed=12
#avrddopti.menu.clock.12extclock.build.clocksource=2
#avrddopti.menu.clock.8extclock=8 MHz ext. clock
#avrddopti.menu.clock.8extclock.build.f_cpu=8000000L
#avrddopti.menu.clock.8extclock.build.speed=8
#avrddopti.menu.clock.8extclock.build.clocksource=2
#avrddopti.menu.clock.28internal=28 MHz internal (overclocked)
#avrddopti.menu.clock.28internal.build.f_cpu=28000000L
#avrddopti.menu.clock.28internal.build.speed=28
#avrddopti.menu.clock.28internal.build.clocksource=0
#avrddopti.menu.clock.32internal=32 MHz internal (overclocked)
#avrddopti.menu.clock.32internal.build.f_cpu=32000000L
#avrddopti.menu.clock.32internal.build.speed=32
#avrddopti.menu.clock.32internal.build.clocksource=0
#avrddopti.menu.clock.25crystal=25 MHz crystal (slightly overclocked)
#avrddopti.menu.clock.25crystal.build.f_cpu=25000000L
#avrddopti.menu.clock.25crystal.build.speed=25
#avrddopti.menu.clock.25crystal.build.clocksource=1
#avrddopti.menu.clock.28crystal=28 MHz crystal (overclocked)
#avrddopti.menu.clock.28crystal.build.f_cpu=28000000L
#avrddopti.menu.clock.28crystal.build.speed=28
#avrddopti.menu.clock.28crystal.build.clocksource=1
#avrddopti.menu.clock.30crystal=30 MHz ext. clock (overclocked)
#avrddopti.menu.clock.30crystal.build.f_cpu=30000000L
#avrddopti.menu.clock.30crystal.build.speed=30
#avrddopti.menu.clock.30crystal.build.clocksource=1
#avrddopti.menu.clock.32crystal=32 MHz crystal (overclocked)
#avrddopti.menu.clock.32crystal.build.f_cpu=32000000L
#avrddopti.menu.clock.32crystal.build.speed=32
#avrddopti.menu.clock.32crystal.build.clocksource=1
#avrddopti.menu.clock.36crystal=36 MHz crystal (overclocked)
#avrddopti.menu.clock.36crystal.build.f_cpu=36000000L
#avrddopti.menu.clock.36crystal.build.speed=36
#avrddopti.menu.clock.36crystal.build.clocksource=1
#avrddopti.menu.clock.40crystal=40 MHz crystal (overclocked)
#avrddopti.menu.clock.40crystal.build.f_cpu=40000000L
#avrddopti.menu.clock.40crystal.build.speed=40
#avrddopti.menu.clock.40crystal.build.clocksource=1
#avrddopti.menu.clock.25extclock=25 MHz ext. clock (slightly overclocked)
#avrddopti.menu.clock.25extclock.build.f_cpu=25000000L
#avrddopti.menu.clock.25extclock.build.speed=25
#avrddopti.menu.clock.25extclock.build.clocksource=2
#avrddopti.menu.clock.28extclock=28 MHz ext. clock (overclocked)
#avrddopti.menu.clock.28extclock.build.f_cpu=28000000L
#avrddopti.menu.clock.28extclock.build.speed=28
#avrddopti.menu.clock.28extclock.build.clocksource=2
#avrddopti.menu.clock.30extclock=30 MHz ext. clock (overclocked)
#avrddopti.menu.clock.30extclock.build.f_cpu=30000000L
#avrddopti.menu.clock.30extclock.build.speed=30
#avrddopti.menu.clock.30extclock.build.clocksource=2
#avrddopti.menu.clock.32extclock=32 MHz ext. clock (overclocked)
#avrddopti.menu.clock.32extclock.build.f_cpu=32000000L
#avrddopti.menu.clock.32extclock.build.speed=32
#avrddopti.menu.clock.32extclock.build.clocksource=2
#avrddopti.menu.clock.36extclock=36 MHz ext. clock (overclocked)
#avrddopti.menu.clock.36extclock.build.f_cpu=36000000L
#avrddopti.menu.clock.36extclock.build.speed=36
#avrddopti.menu.clock.36extclock.build.clocksource=2
#avrddopti.menu.clock.40extclock=40 MHz ext. clock (overclocked)
#avrddopti.menu.clock.40extclock.build.f_cpu=40000000L
#avrddopti.menu.clock.40extclock.build.speed=40
#avrddopti.menu.clock.40extclock.build.clocksource=2
#avrddopti.menu.clock.48extclock=48 MHz ext. clock (WAY overclocked)
#avrddopti.menu.clock.48extclock.build.f_cpu=48000000L
#avrddopti.menu.clock.48extclock.build.speed=48
#avrddopti.menu.clock.48extclock.build.clocksource=2

